In [3]:
import pandas as pd

In [4]:
import numpy as np
import pandas as pd
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [5]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')   
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [6]:
titanic_train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [7]:
titanic_train.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
146,147,1,3,"Andersson, Mr. August Edvard (""Wennerstrom"")",male,27.0,0,0,350043,7.7958,NaN,S
147,148,0,3,"Ford, Miss. Robina Maggie ""Ruby""",female,9.0,2,2,W./C. 6608,34.3750,NaN,S
148,149,0,2,"Navratil, Mr. Michel (""Louis M Hoffman"")",male,36.5,0,2,230080,26.0000,F2,S
149,150,0,2,"Byles, Rev. Thomas Roussel Davids",male,42.0,0,0,244310,13.0000,NaN,S
150,151,0,2,"Bateman, Rev. Robert James",male,51.0,0,0,S.O.P. 1166,12.5250,NaN,S
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [8]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [12]:
titanic_train.dtypes == "object"
a = titanic_train.dtypes[titanic_train.dtypes == "object"].index
a
titanic_train[a].describe()

                                     Name   Sex      Ticket Cabin Embarked
count                                 156   156         156    31      155
unique                                156     2         145    28        3
top     Byles, Rev. Thomas Roussel Davids  male  W./C. 6608   D26        S
freq                                    1   100           2     2      110

In [11]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [101]:
titanic_train.dtypes[titanic_train.dtypes == "object"].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [7]:
titanic_train.dtypes[titanic_train.dtypes == "object"]


titanic_train.dtypes[titanic_train.dtypes == "object"].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [13]:
titanic_train.dtypes[titanic_train.dtypes == "object"]

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [103]:
list_col = titanic_train.dtypes[titanic_train.dtypes == "object"].index
titanic_train[list_col].describe()

                                Name   Sex  Ticket Cabin Embarked
count                            156   156     156    31      155
unique                           156     2     145    28        3
top     Williams, Mr. Charles Eugene  male  113803  C123        S
freq                               1   100       2     2      110

In [14]:
titanic_train[['Name','Cabin','Age']]

                                                  Name Cabin   Age
0                              Braund, Mr. Owen Harris   NaN  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   C85  38.0
2                               Heikkinen, Miss. Laina   NaN  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  C123  35.0
4                             Allen, Mr. William Henry   NaN  35.0
..                                                 ...   ...   ...
151                  Pears, Mrs. Thomas (Edith Wearne)    C2  22.0
152                                   Meo, Mr. Alfonzo   NaN  55.5
153                    van Billiard, Mr. Austin Blyler   NaN  40.5
154                              Olsen, Mr. Ole Martin   NaN   NaN
155                        Williams, Mr. Charles Duane   NaN  51.0

[156 rows x 3 columns]

In [16]:
sorted(titanic_train["Name"])[2:20:3]# Check the first 15 sorted names   s[0][1:10:2]

['Andersson, Miss. Ellis Anna Maria',
 'Andersson, Mr. August Edvard ("Wennerstrom")',
 'Arnold-Franchi, Mrs. Josef (Josefine Franchi)',
 'Backstrom, Mrs. Karl Alfred (Maria Mathilda Gustafsson)',
 'Baxter, Mr. Quigg Edmond',
 'Bonnell, Miss. Elizabeth']

In [167]:
titanic_train["Name"].describe()

count                              156
unique                             156
top       Williams, Mr. Charles Eugene
freq                                 1
Name: Name, dtype: object

In [17]:
titanic_train[["Ticket"]][4:9]

   Ticket
4  373450
5  330877
6   17463
7  349909
8  347742

In [18]:
#titanic_train["Ticket"].describe()
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [21]:
titanic_train["sam"]="hshskk"
titanic_train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sam
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,hshskk
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,hshskk
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,hshskk
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,hshskk
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,hshskk
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,hshskk
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,hshskk
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,hshskk
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S,hshskk
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,hshskk

In [23]:
titanic_train["Ticket"][0:15:2]       # Check the first 15 tickets

0            A/5 21171
2     STON/O2. 3101282
4               373450
6                17463
8               347742
10             PP 9549
12           A/5. 2151
14              350406
Name: Ticket, dtype: object

In [118]:
titanic_train.dtypes# Check number of unique cabins

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
test             int64
dtype: object

In [24]:
titanic_train["Survived"]

0      0
1      1
2      1
3      1
4      0
      ..
151    1
152    0
153    0
154    0
155    0
Name: Survived, Length: 156, dtype: int64

In [119]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'test'],
      dtype='object')

In [120]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,test
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000,156.0
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587,0.0
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047,0.0
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000,0.0
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150,0.0
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200,0.0
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850,0.0
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000,0.0

In [25]:
new_Pclass = pd.Categorical(titanic_train["Pclass"])

new_Pclass

[3, 1, 3, 1, 3, ..., 1, 3, 3, 3, 1]
Length: 156
Categories (3, int64): [1, 2, 3]

In [179]:
new_Pclass = pd.Categorical(titanic_train["Pclass"])
new_Pclass

[3, 1, 3, 1, 3, ..., 1, 3, 3, 3, 1]
Length: 156
Categories (3, int64): [1, 2, 3]

In [26]:
titanic_train["Cabin"].unique()   # Check unique cabins

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2'], dtype=object)

In [29]:
import numpy as np 
char_cabin = titanic_train["Cabin"].astype(str) # Convert data to str

new_Cabin = [cabin[0] for cabin in char_cabin] # Take first letter       0,1,2,3,4,5,6,7,8    for i in n:

new_Cabin = pd.Categorical(new_Cabin)
#new_Cabin
new_Cabin

['n', 'C', 'n', 'C', 'n', ..., 'C', 'n', 'n', 'n', 'n']
Length: 156
Categories (8, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'n']

In [30]:
titanic_train["Cabin"] = new_Cabin
titanic_train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sam
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,n,S,hshskk
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C,hshskk
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,n,S,hshskk
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S,hshskk
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,n,S,hshskk
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,n,Q,hshskk
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E,S,hshskk
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,n,S,hshskk
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,n,S,hshskk
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,n,C,hshskk

In [33]:
titanic_train["Age"].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154     True
155    False
Name: Age, Length: 156, dtype: bool

In [99]:
missing = np.where(titanic_train["Age"].isnull() == True)
missing

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154], dtype=int64),)

In [100]:
np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))

(array([27, 88], dtype=int64),)

In [101]:
np.where(titanic_train["Family"]==max(titanic_train["Family"]))

(array([59, 71], dtype=int64),)

In [102]:
titanic_train.iloc[np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sam,Family
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0,C,S,hshskk,5
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0,C,S,hshskk,5

In [103]:
np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))

(array([27, 88], dtype=int64),)

In [104]:
len(missing[0])

30

In [107]:
len(missing[0])

30

In [39]:
titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]
titanic_train["Family"]
most_family = np.where(titanic_train["Family"] == max(titanic_train["Family"]))
most_family

(array([59, 71], dtype=int64),)

In [114]:
#titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]

most_family = np.where(titanic_train["Family"] == max(titanic_train["Family"]))
most_family
titanic_train.iloc[most_family]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sam,Family
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9,n,S,hshskk,7
71,72,0,3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,CA 2144,46.9,n,S,hshskk,7

In [118]:
titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]

most_family = np.where(titanic_train["Age"] == max(titanic_train["Age"]))
most_family
titanic_train.iloc[most_family]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sam,Family
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A,C,hshskk,0

In [117]:
most_family = np.where(titanic_train["Pclass"] == max(titanic_train["Pclass"]))
most_family
titanic_train.iloc[most_family]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,sam,Family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,n,S,hshskk,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,n,S,hshskk,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,n,S,hshskk,0
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,n,Q,hshskk,0
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,n,S,hshskk,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
146,147,1,3,"Andersson, Mr. August Edvard (""Wennerstrom"")",male,27.0,0,0,350043,7.7958,n,S,hshskk,0
147,148,0,3,"Ford, Miss. Robina Maggie ""Ruby""",female,9.0,2,2,W./C. 6608,34.3750,n,S,hshskk,4
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,n,S,hshskk,0
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,n,S,hshskk,2
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,n,S,hshskk,0

In [50]:
import numpy as np
import pandas as pd

labels = ['c','b','a']
my_data = [10,20,50]
arr = np.array(my_data)
d = {'c':10,'b':20,'a':50}

print ("Labels:", labels)
print("My data:", my_data)
#print("Dictionary:", d)
pd.Series(my_data, index=labels)

Labels: ['c', 'b', 'a']
My data: [10, 20, 50]

c    10
b    20
a    50
dtype: int64

In [44]:
pd.Series(my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [55]:
print ("\nHolding numerical data\n",'-'*25,  sep='')
print(pd.Series(arr)[1])

Holding numerical data
-------------------------
20

In [198]:
print ("\nHolding text labels\n",'-'*20, sep='')
print(pd.Series(labels))

Holding text labels
--------------------
0    a
1    b
2    c
dtype: object

In [57]:

d = {'a':"kjhk",'b':20,'c':30}
#d.items
pd.DataFrame(d,index = ['a','b','c'],columns=['a','b','c'])
pd.DataFrame(d,index = ['a','b','c'],columns=['a','b','c'])

      a   b   c
a  kjhk  20  30
b  kjhk  20  30
c  kjhk  20  30

In [59]:
print ("\nHolding objects from a dictionary\n",'-'*40, sep='')
print(pd.Series([type, sum, min]))

Holding objects from a dictionary
----------------------------------------
0             <class 'type'>
1    <built-in function sum>
2    <built-in function min>
dtype: object

In [74]:
ser1 = pd.Series([1,2,3,4],index = [0,1,2,3])     # ser[0],ser[1]
ser2 = pd.Series([1,2,5,4,7,8],index = ['CA', 'OR', 'NV', 'AZ','NJ','NR'])
#ser1
#ser2
ser1

0    1
1    2
2    3
3    4
dtype: int64

In [77]:
ser3 = pd.Series(["he","k","ko","po","pj","gh"],index = ['CA', 'OR', 'NV', 'AZ','NJ','NR'])

In [79]:
ser3

CA    he
OR     k
NV    ko
AZ    po
NJ    pj
NR    gh
dtype: object

In [76]:
#ser1[0:3:2]
ser2[0:6]

CA    1
OR    2
NV    5
AZ    4
NJ    7
NR    8
dtype: int64

In [80]:
print ("\nIndexing by number (positional value in the series)\n",'-'*52, sep='')
print("Value for CA in ser1:", ser3[0])
print("Value for AZ in ser1:", ser3[3])
print("Value for NV in ser2:", ser3[2])
ser3

Indexing by number (positional value in the series)
----------------------------------------------------
Value for CA in ser1: he
Value for AZ in ser1: po
Value for NV in ser2: ko

CA    he
OR     k
NV    ko
AZ    po
NJ    pj
NR    gh
dtype: object

In [83]:
print ("\nIndexing by a range\n",'-'*25, sep='')
print ("Value for OR, CO, and AZ in ser3:\n", ser3[0:3:2], sep='')

Indexing by a range
-------------------------
Value for OR, CO, and AZ in ser3:
CA    he
NV    ko
dtype: object

In [87]:
ser1 = pd.Series([1,2,3,4],['CA', 'OR', 'CO', 'CA'])
ser2 = pd.Series([1,2,5,4.5],['CA', 'NV', 'AZ','OR'])  #[CA,AZ,NV,OR,CO,CA]
ser3 = ser1+ser2
ser3

AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.5
dtype: float64

In [88]:
print ("\nAfter adding the two series, the result looks like this...\n",'-'*59, sep='')
print(ser3)
print("\nPython tries to add values where it finds common index name, and puts NaN where indices are missing\n")

After adding the two series, the result looks like this...
-----------------------------------------------------------
AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.5
dtype: float64

Python tries to add values where it finds common index name, and puts NaN where indices are missing

In [89]:
ser1 = pd.Series([1,2,3,4],['CA', 'OR', 'CO', 'CA'])
ser2 = pd.Series([1,2,5,4.5],['CA', 'NV', 'AZ','OR'])  #[CA,AZ,NV,OR,CO,CA]
print ("\nThe idea works even for multiplication...\n",'-'*43, sep='')
print (ser1*ser2)

The idea works even for multiplication...
-------------------------------------------
AZ    NaN
CA    1.0
CA    4.0
CO    NaN
NV    NaN
OR    9.0
dtype: float64

In [120]:
from numpy.random import randn as rn
#np.random.seed(101)
matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']

df = pd.DataFrame(matrix_data,row_labels,column_headings)
#print("\nThe data frame looks like\n",'-'*45, sep='')
df

          W         X         Y         Z
A  1.550763 -0.249641  0.754159  0.451219
B  0.978325  0.191120  0.645257  0.857851
C  2.376916  0.380429 -0.084083  1.372481
D  0.954444 -0.261155  2.671679 -0.117746
E -0.480709 -0.750778 -0.316164  0.022734

In [136]:
from numpy.random import randn as rn
#np.random.seed(101)
matrix_data = rn(4,4)
row_labels = ['B','C','D','E']
column_headings = ['W','X','Y','Z']

df = pd.DataFrame(matrix_data,row_labels,column_headings)
#print("\nThe data frame looks like\n",'-'*45, sep='')
df

          W         X         Y         Z
B -0.107944 -1.056105 -0.344452  1.479286
C  1.490050  0.243316 -0.115594  0.170336
D -0.556659  0.931474 -2.115158  0.870140
E  0.501051 -1.891327  0.611045 -1.667542

In [137]:
df.iloc[2]

W   -0.556659
X    0.931474
Y   -2.115158
Z    0.870140
Name: D, dtype: float64

In [139]:
df.iloc[1]

W    1.490050
X    0.243316
Y   -0.115594
Z    0.170336
Name: C, dtype: float64

In [124]:
df.iloc[1]

W    0.720634
X   -1.175051
Y    0.895173
Z    0.481477
Name: C, dtype: float64

In [140]:
print("\nType of the pair of columns: ", type(df[['X','Z']]), sep='')
print ("\nSo, for more than one column, the object turns into a DataFrame")

Type of the pair of columns: <class 'pandas.core.frame.DataFrame'>

So, for more than one column, the object turns into a DataFrame

In [141]:
print("\nThe 'X' column accessed by DOT method (NOT recommended)\n",'-'*55, sep='')
print(df["X"])
#

The 'X' column accessed by DOT method (NOT recommended)
-------------------------------------------------------
B   -1.056105
C    0.243316
D    0.931474
E   -1.891327
Name: X, dtype: float64

In [142]:
df["Y"]

B   -0.344452
C   -0.115594
D   -2.115158
E    0.611045
Name: Y, dtype: float64

In [143]:
print(df["Z"])

B    1.479286
C    0.170336
D    0.870140
E   -1.667542
Name: Z, dtype: float64

In [144]:
print("\nA column is created by assigning it in relation to an existing column\n",'-'*75, sep='')
df['New'] = df['X']+df['Z']
#df['New (Sum of X and Z)'] = df['X']+df['Z']
print(df)

A column is created by assigning it in relation to an existing column
---------------------------------------------------------------------------
          W         X         Y         Z       New
B -0.107944 -1.056105 -0.344452  1.479286  0.423181
C  1.490050  0.243316 -0.115594  0.170336  0.413652
D -0.556659  0.931474 -2.115158  0.870140  1.801614
E  0.501051 -1.891327  0.611045 -1.667542 -3.558869

In [129]:
print("\nA column is created by assigning it in relation to an existing column\n", sep='')
df['New'] = df['X']+df['Z']
#df['New (Sum of X and Z)'] = df['X']+df['Z']
print(df)

A column is created by assigning it in relation to an existing column

          W         X         Y         Z       New
B -0.348162 -0.570101 -1.677781  0.306739 -0.263362
C  0.720634 -1.175051  0.895173  0.481477 -0.693574
D -0.362604 -0.843248 -0.364532  1.176546  0.333298
E  0.220986  0.462594  0.889639  0.694005  1.156599

In [145]:
df

          W         X         Y         Z       New
B -0.107944 -1.056105 -0.344452  1.479286  0.423181
C  1.490050  0.243316 -0.115594  0.170336  0.413652
D -0.556659  0.931474 -2.115158  0.870140  1.801614
E  0.501051 -1.891327  0.611045 -1.667542 -3.558869

In [131]:
print("\nA column is dropped by using df.drop() method\n",'-'*55, sep=' ')
df.drop("C",inplace=True) # Notice the axis=1 option, axis = 0 is default, so one has to change it to 1

A column is dropped by using df.drop() method
 -------------------------------------------------------

In [146]:
df

          W         X         Y         Z       New
B -0.107944 -1.056105 -0.344452  1.479286  0.423181
C  1.490050  0.243316 -0.115594  0.170336  0.413652
D -0.556659  0.931474 -2.115158  0.870140  1.801614
E  0.501051 -1.891327  0.611045 -1.667542 -3.558869

In [147]:
df1=df.drop('E')
print("\nA row (index) is dropped by using df.drop() method and axis=0\n",'-'*65, sep='')
print(df1)

A row (index) is dropped by using df.drop() method and axis=0
-----------------------------------------------------------------
          W         X         Y         Z       New
B -0.107944 -1.056105 -0.344452  1.479286  0.423181
C  1.490050  0.243316 -0.115594  0.170336  0.413652
D -0.556659  0.931474 -2.115158  0.870140  1.801614

In [152]:
print("\nAn in-place change can be done by making inplace=True in the drop method\n",'-'*75, sep='')
df.drop('D')
print(df)

An in-place change can be done by making inplace=True in the drop method
---------------------------------------------------------------------------
          W         X         Y         Z       New
B -0.107944 -1.056105 -0.344452  1.479286  0.423181
C  1.490050  0.243316 -0.115594  0.170336  0.413652
D -0.556659  0.931474 -2.115158  0.870140  1.801614
E  0.501051 -1.891327  0.611045 -1.667542 -3.558869

In [148]:
df.drop()

          W         X         Y         Z       New
B -0.107944 -1.056105 -0.344452  1.479286  0.423181
C  1.490050  0.243316 -0.115594  0.170336  0.413652
D -0.556659  0.931474 -2.115158  0.870140  1.801614
E  0.501051 -1.891327  0.611045 -1.667542 -3.558869

In [153]:
### Selecting/indexing Rows
#* Label-based 'loc' method
#* Index (numeric) 'iloc' method
df

          W         X         Y         Z       New
B -0.107944 -1.056105 -0.344452  1.479286  0.423181
C  1.490050  0.243316 -0.115594  0.170336  0.413652
D -0.556659  0.931474 -2.115158  0.870140  1.801614
E  0.501051 -1.891327  0.611045 -1.667542 -3.558869

In [58]:
print("\nLabel-based 'loc' method can be used for selecting row(s)\n",'-'*60, sep='')
print("\nSingle row\n")
print(df.iloc[3])

Label-based 'loc' method can be used for selecting row(s)
------------------------------------------------------------

Single row

W      0.133687
X      1.988570
Y      0.416920
Z     -0.729497
New    1.259073
Name: E, dtype: float64

In [154]:
print("\nMultiple rows\n")
print(df.loc[['B','C']])

Multiple rows

          W         X         Y         Z       New
B -0.107944 -1.056105 -0.344452  1.479286  0.423181
C  1.490050  0.243316 -0.115594  0.170336  0.413652

In [60]:
print("\nIndex position based 'iloc' method can be used for selecting row(s)\n",'-'*70, sep='')
print("\nSingle row\n")
print(df.iloc[2])

Index position based 'iloc' method can be used for selecting row(s)
----------------------------------------------------------------------

Single row

W      1.124639
X      0.626070
Y     -0.129314
Z     -0.075665
New    0.550405
Name: D, dtype: float64

In [158]:
print("\nMultiple rows\n")
print(df.iloc[[1,2]])

Multiple rows

          W         X         Y         Z       New
C  1.490050  0.243316 -0.115594  0.170336  0.413652
D -0.556659  0.931474 -2.115158  0.870140  1.801614

In [156]:
df

          W         X         Y         Z       New
B -0.107944 -1.056105 -0.344452  1.479286  0.423181
C  1.490050  0.243316 -0.115594  0.170336  0.413652
D -0.556659  0.931474 -2.115158  0.870140  1.801614
E  0.501051 -1.891327  0.611045 -1.667542 -3.558869

In [62]:
#### Subsetting DataFrame

In [63]:

matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)

In [160]:
print("\nThe DatFrame\n",'-'*45, sep='')
print(df)

The DatFrame
---------------------------------------------
          W         X         Y         Z       New
B -0.107944 -1.056105 -0.344452  1.479286  0.423181
C  1.490050  0.243316 -0.115594  0.170336  0.413652
D -0.556659  0.931474 -2.115158  0.870140  1.801614
E  0.501051 -1.891327  0.611045 -1.667542 -3.558869

In [161]:
print("\nElement at row 'B' and column 'Y' is\n") 
print(df.loc[['B','C'],['Y','W']])

Element at row 'B' and column 'Y' is

          Y         W
B -0.344452 -0.107944
C -0.115594  1.490050

In [169]:
print("\nSubset comprising of rows C,D,E and columns W and X, is\n")
df.iloc[[1,2,3],[0,1]]

Subset comprising of rows C,D,E and columns W and X, is

          W         X
C  1.490050  0.243316
D -0.556659  0.931474
E  0.501051 -1.891327

In [167]:
df

          W         X         Y         Z       New
B -0.107944 -1.056105 -0.344452  1.479286  0.423181
C  1.490050  0.243316 -0.115594  0.170336  0.413652
D -0.556659  0.931474 -2.115158  0.870140  1.801614
E  0.501051 -1.891327  0.611045 -1.667542 -3.558869

In [170]:
print(df.loc[['B','C'],])

          W         X         Y         Z       New
B -0.107944 -1.056105 -0.344452  1.479286  0.423181
C  1.490050  0.243316 -0.115594  0.170336  0.413652

In [171]:
print("\nThe DataFrame\n",'-'*45, sep='')
print(df)

The DataFrame
---------------------------------------------
          W         X         Y         Z       New
B -0.107944 -1.056105 -0.344452  1.479286  0.423181
C  1.490050  0.243316 -0.115594  0.170336  0.413652
D -0.556659  0.931474 -2.115158  0.870140  1.801614
E  0.501051 -1.891327  0.611045 -1.667542 -3.558869

In [174]:
print("\nBoolean DataFrame(s) where we are checking if the values are greater than 0\n",'-'*75, sep='')
print(df>0)
# less than <0 will be False
# greater than >0 will be True

Boolean DataFrame(s) where we are checking if the values are greater than 0
---------------------------------------------------------------------------
       W      X      Y      Z    New
B  False  False  False   True   True
C   True   True  False   True   True
D  False   True  False   True   True
E   True  False   True  False  False

In [176]:
print("\n")
print(df.loc[['B','C']]>0)

       W      X      Y     Z   New
B  False  False  False  True  True
C   True   True  False  True  True

In [177]:
booldf = df>0
print("\nDataFrame indexed by boolean dataframe\n",'-'*45, sep='')
print(df[booldf])

DataFrame indexed by boolean dataframe
---------------------------------------------
          W         X         Y         Z       New
B       NaN       NaN       NaN  1.479286  0.423181
C  1.490050  0.243316       NaN  0.170336  0.413652
D       NaN  0.931474       NaN  0.870140  1.801614
E  0.501051       NaN  0.611045       NaN       NaN

In [179]:

import pandas as pd 
import numpy as np
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']
matrix_data

matrix([[ 22,  66, 140],
        [ 42,  70, 148],
        [ 30,  62, 125],
        [ 35,  68, 160],
        [ 25,  62, 152]])

In [182]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nA new DataFrame\n",'-'*25, sep='')
print(df)

A new DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [184]:
df[df["Weight"]<145]

   Age  Height  Weight
A   22      66     140
C   30      62     125

In [185]:
df[df['Height']>65]

   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [186]:
print("\nRows with Height > 65 inch\n",'-'*35, sep='')
print(df[df['Height']>65])

Rows with Height > 65 inch
-----------------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [187]:
df['Height']>65

A     True
B     True
C    False
D     True
E    False
Name: Height, dtype: bool

In [189]:
df[df['Height']>65]

   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [188]:
df

   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [191]:
booldf1 = df['Height']>65
booldf2 = df['Weight']>145
boo1df1

NameError: name 'boo1df1' is not defined

In [78]:
print("\nRows with Height > 65 inch and Weight >145 lbs\n",'-'*55, sep='')
print(df[(booldf1) & (booldf2)])

Rows with Height > 65 inch and Weight >145 lbs
-------------------------------------------------------
   Age  Height  Weight
B   42      70     148
D   35      68     160

In [79]:
print("\nDataFrame with only Age and Weight columns whose Height > 65 inch\n",'-'*68, sep='')
print(df[booldf1][['Age','Weight']])

DataFrame with only Age and Weight columns whose Height > 65 inch
--------------------------------------------------------------------
   Age  Weight
A   22     140
B   42     148
D   35     160

In [80]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']

In [192]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nThe DataFrame\n",'-'*25, sep='')
print(df)

The DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [193]:
print("\nAfter resetting index\n",'-'*35, sep='')
print(df.reset_index())

After resetting index
-----------------------------------
  index  Age  Height  Weight
0     A   22      66     140
1     B   42      70     148
2     C   30      62     125
3     D   35      68     160
4     E   25      62     152

In [194]:
print("\nAfter resetting index with 'drop' option TRUE\n",'-'*45, sep='')
print(df.reset_index(drop=True))
"Student Teacher Engineer Doctor Nurse".split()

After resetting index with 'drop' option TRUE
---------------------------------------------
   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

['Student', 'Teacher', 'Engineer', 'Doctor', 'Nurse']

In [196]:
print("\nAdding a new column 'Profession'\n",'-'*45, sep='')
df['Profession'] = "Student Teacher Engineer Doctor Nurse".split()
print(df)

Adding a new column 'Profession'
---------------------------------------------
   Age  Height  Weight Profession
A   22      66     140    Student
B   42      70     148    Teacher
C   30      62     125   Engineer
D   35      68     160     Doctor
E   25      62     152      Nurse

In [199]:
print("\nSetting 'Profession' column as index\n",'-'*45, sep='')
print (df.set_index('Profession'))

Setting 'Profession' column as index
---------------------------------------------
            Age  Height  Weight
Profession
Student      22      66     140
Teacher      42      70     148
Engineer     30      62     125
Doctor       35      68     160
Nurse        25      62     152

In [201]:
#multi-indexing
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

In [202]:
print("\nTuple pairs after the zip and list command\n",'-'*45, sep='')
print(hier_index)

Tuple pairs after the zip and list command
---------------------------------------------
[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [214]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
print("\nIndex hierarchy\n",'-'*25, sep='')
print(hier_index)

Index hierarchy
-------------------------
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [205]:
print("\nIndex hierarchy type\n",'-'*25, sep='')
print(type(hier_index))

Index hierarchy type
-------------------------
<class 'pandas.core.indexes.multi.MultiIndex'>

In [213]:
a=2
b=3
c=a+b
print(c)
type(c)

5

int

In [209]:
print("\nCreating DataFrame with multi-index\n",'-'*37, sep='')
#np.random.seed(101)
df1 = pd.DataFrame(data=np.round(rn(6,3)), index= hier_index, columns= ['A','B','C'])
print(df1)
#rn = randn

Creating DataFrame with multi-index
-------------------------------------
        A    B    C
G1 1  0.0  1.0  1.0
   2  1.0 -0.0  0.0
   3  1.0  1.0  1.0
G2 1  1.0 -0.0 -2.0
   2 -1.0 -0.0  0.0
   3  1.0 -1.0  0.0

In [210]:
#cross tabulation like pivot table

In [211]:
print("\nGrabbing a cross-section from outer level\n",'-'*45, sep='')
print(df1.xs('G1'))

Grabbing a cross-section from outer level
---------------------------------------------
     A    B    C
1  0.0  1.0  1.0
2  1.0 -0.0  0.0
3  1.0  1.0  1.0

In [212]:
print("\nGrabbing a cross-section from outer level\n",'-'*45, sep='')
print(df1.xs('G2'))

Grabbing a cross-section from outer level
---------------------------------------------
     A    B    C
1  1.0 -0.0 -2.0
2 -1.0 -0.0  0.0
3  1.0 -1.0  0.0